package com.example.linkmain;

public class StoreDBClass {

    StoreClass[] store = new StoreClass[100];

    //하드코딩
    public void storedbclass(){
            store[0] = new StoreClass("대일전기", "전기","대전광역시 대덕구 오전동 370-9", 36.349524, 127.414039, "042-633-0765", "NULL", "NULL", false);
            store[1] = new StoreClass("LS산전","전기","대전광역시 대덕구 오정동 298-5", 36.354680,127.407600,"NULL","월-금 08:30~18:00 / 토 08:30~15:00","일요일",false);
            store[2] = new StoreClass("백제종합전기", "전기","대전광역시 대덕구 오정로 22", 36.349128,127.415073,"042-622-1670", "NULL","NULL",false);
            store[3] = new StoreClass("명일전기", "전기","대전광역시 대덕구 오정로 26", 36.350293,127.413880,"042-631-5894","월~토 08:00~19:00","일요일, 명절",true);
            store[4] = new StoreClass("상일전기", "전기","대전광역시 대덕구 오정동 103-18", 36.353716,127.411533,"042-633-3017","NULL","NULL",false);
            store[5] = new StoreClass("SJ종합상사", "공구","대전광역시 대덕구 오정로 9번길 2", 36.349102,127.414857,"042-284-0289","월~금 07:30~18:00 / 토 07:30~15:00","일요일",false);
            store[6] = new StoreClass("영신공구", "공구","대전광역시 대덕구 오정로 17", 36.349166,127.414195,"NULL","NULL","NULL",false);
            store[7] = new StoreClass("대선종합상사","공구","대전광역시 대덕구 오정로 19", 36.349378,127.413925,"042-624-8028","월~토 07:00~19:00","일요일",false);
            store[8] = new StoreClass("현대종합공구", "공구","대전광역시 대덕구 오정로 119번길", 36.355858,127.406221,"042-623-0909","월~토 07:00~19:00","일요일",true);
            store[9] = new StoreClass("동진공구철물", "공구","대전광역시 대덕구 오정동 292-11", 36.355298,127.406416,"042-621-1374","월~토 07:00~18:00","일요일",true);
            store[10] = new StoreClass("힐티대전기업","공구","대전광역시 대덕구 오정로 298-7번지", 36.354751,127.407293, "010-5406-0982","월~토 07:00~19:00","일요일",true);
            store[11] = new StoreClass("강산건재철물", "공구","대전광역시 대덕구 오정로 101", 36.354754,127.407496,"042-635-7765","월~토 : 07:00~18:00","일요일, 명절",true);
            store[12] = new StoreClass("동우공구","공구","대전광역시 대덕구 오정동 323-5",36.353176,127.409247,"042-621-7455","NULL","NULL",false);
            store[13] = new StoreClass("두리상사", "공구","대전광역시 대덕구 오정동 299-9",36.354441,127.407750,"042-635-2933","월~토 07:00~18:00","일요일",true);
            store[14] = new StoreClass("번영공구백화점", "공구","대전광역시 대덕구 오정로 97",36.354202,127.407906,"042-626-0945","월~일 07:00~18:30","구정,신정",true);
            store[15] = new StoreClass("동한상사","공구","대전광역시 대덕구 오정동 338-7",36.351844,127.410948,"042-624-4349 / 010-3456-4349","월~토 06:30~19:30","일요일",true);
            store[16] = new StoreClass("금성종합상사", "공구","대전광역시 대덕구 오정동 287-5",36.351269,127.412470,"042-626-0975","NULL","NULL",false);
            store[17] = new StoreClass("대성종합기계상사","공구","대전광역시 대덕구 오정로 45",36.351156,127.411930,"042-637-0986","월~토 08:00~18:00","일요일",true);
            store[18] = new StoreClass("금강종합상사", "공구","대전광역시 대덕구 오정로 88", 36.353920,127.408853,"042-628-5315","NULL","NULL",false);
            store[19] = new StoreClass("경보상사", "공구","대전광역시 대덕구 오절오 27",36.349964,127.413610,"NULL","NULL","NULL",false);
            store[20] = new StoreClass("현대로프상사", "공구","대전광역시 대덕구 오정로 14",36.349424,127.414688,"042-634-4629","NULL","NULL",false);
            store[21] = new StoreClass("오정공구","공구","대전광역시 대덕구 오정로 57",36.351932,127.411006,"042-636-3477","월~토 07:00~19:00","일요일, 명절연휴",true);
            store[22] = new StoreClass("삼원공구", "공구","대전광역시 대덕구 오정로 64번길 8", 36.352339,127.410999,"042-621-7778","월~토 06:00~19:00","일요일",true);
            store[23] = new StoreClass("계약전동공구", "공구","대전광역시 대덕구 오정동 299-9",36.354431,127.407752,"042-631-8141","NULL","NULL",false);
            store[24] = new StoreClass("한양종합상사", "공구","대전광역시 대덕구 오정로 10", 36.349118,127.415014,"042-634-3309","NULL","NULL",false);
            store[25] = new StoreClass("신세계철물", "철물","대전광역시 대덕구 오정로 80",36.353553,127.409310,"NULL","NULL","NULL",false);
            store[26] = new StoreClass("금강스틸", "철공예","대덕구 오정로 9번길 2",36.348921,127.415021,"042-226-8000","월~금 08:00~18:00. 토 08:00~15:00","일요일, 공휴일",false);
            store[27] = new StoreClass("명용접기", "철공예","대전광역시 대덕구 오정로 21", 36.349601,127.413819, "042-623-0940","NULL","NULL",false);
            store[28] = new StoreClass("후지육절기/저울","철공예","대전광역시 대덕구 오정동 299-13", 36.353918,127.408361,"042-631-7013","NULL", "NULL",false);
            store[29] = new StoreClass("광덕금속", "철공예","대전광역시 대덕구 오정동 338-7",36.351906,127.411002,"042-623-6061","NULL","NULL",false);
            store[30] = new StoreClass("신성철망", "철공예","대전광역시 대덕구 오정로 57",36.352355,127.410422,"042-627-7070","월~토 07:00~18:00","일요일",true);
    }
}